# Задача 2
# Найдите сумму цифр трехзначного числа.
#
# Пример:
#
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

number = int(input("Введите трехзначное число: "))

n = number
summa = 0
while n > 0:
    num = n % 10
    summa += num
    n = n // 10

print(f"Сумма цифр числа {number} равна {summa}")
