# Задача 2
# Найдите сумму цифр трехзначного числа.
#
# Пример:
#
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

n = int(input("Введите трехзначное число: "))

num1 = n % 10
n = n // 10
num2 = n % 10
n = n // 10
sum = n + num1 + num2

print(f"Сумма цифр числа: {sum}")


